{"pageProps":{"id":"3","post":{"id":3,"title":"How to (not) mess up Git","desc":"Git is more then memorizing a few commands and rm -rf * when things go south. Using git properly is important.","tags":["unreleased"],"url":"how-not-to-mess-up-git","date":"2020-08-21","content":"Git is hard! A lot of people I know only know a couple git commands\n```\n$ git add -A .\n$ git commit -m $message\n$ git checkout $branch\n$ git push origin $branch\n```\nand while this works for 90% of all work done on git, it's woefully incompetent at the other 10%: fixing shit when it breaks.\n\n*Now, just to note, git rarely \"breaks\". It's almost always the developer doing something they shoudn't have.*\n\nThis document is going te be a brief summary on some major misconceptions of Git, and then some specific helpful examples that I've needed to use in my time working with Git, or helping other people with them.\n\n## What branches are\n\nBranches are reference to commits. To rephrase that, a branch is just a pointers to a specific commit.\n\nWhen you are working in git, you have this reference called HEAD, which refers to the current working commit.\nYou are always \"on\" a specific commit, which is reflected in the current state of the source code.\nWith git the was you change between commits is the `git checkout` command.\n\nThere's also \"detached head\" state, where you do not live on a branch but instead a specific commit, named by its hash. This is unusual, but worth noting.\n\n**A key point here is that branches don't technically have multiple commits.**\n\nBranches are a single commit, and each commit is some changes plus it's parent(s).\nHere's a quick example:\n```\n a -> b -> c -> d     <--- master\n      \\\n       \\--> e -> f    <--- dev\n```\n`a` is the initial commit. For the purpose of this page, there is only ever one inital commit - while there can be others, merging them isn't really done.\n\nYou might look at this and say \"okay, well, `e` is on the `dev` branch. And, you'd be almost correct.\nWhile dev does encompase `e`, and `e` is \"on dev\", the `e` commit contains exactly zero information about the `dev` branch. \nYou can see that in the next step:\n```\n a -> b -> c -> d -----> g    <--- master\n      \\                 /\\\n       \\--> e -> f -----/\n```\nIn this step, we merged dev into `g` with a merge commit.\n\nNow what branch is `e` on? It's actually on master - but when you commited, you commited to dev!\nDoing a very basic `git log` will just show you `g, f, d, e, c, b, a`, which has no way to tell the difference between commits done on dev and commits done on master.\n\nThis could be an issue if you wanted to have broken code on dev (say commit `e` doesn't work), and now all the sudden it's on master! Some git loggers will properly split the commits so they visually appear on a different history path then the master branch, but they're still 100% on the master branch without the context of dev.\n\n## Some common Git problems\n\n#### I made a commit to the wrong branch!\n```\na -> b -> c   <--- master\n```\nWhoops, you wanted to make the `c` commit on `dev`! This happens to me at least once a week.\nThe fix is easy, but you have to be careful because it involves rewriting history.\n```\n$ git reset --soft HEAD~1\n```\nThis will reset your git repo to `HEAD~1` (meaning the commit before `HEAD`), but because it's a `--soft` reset, it'll keep all the changes in that commit and put them back into staging. Then you can\n```\n$ git checkeout -b dev\n$ git commit\n```\n\n#### I made a commit to the wrong branch and pushed it!\n\nFirst, check with everyone who works on the project to make sure they haven't touched anything yet.\nIf they haven't, you can delete the `c` commit on master with a force push\n```\n$ git push --force origin master\n```\nHowever, this is *not good* and should be avoided if possible. Branch protection rules are offered by GitHub and GitLab, use them if you need to.\n\n#### I made a commit and now there's a merge conflict"}},"__N_SSG":true}