{"pageProps":{"id":"6","post":{"id":6,"title":"Advent of code, Day 2","desc":"Probably done during english class","tags":["algorithm","aoc","regex"],"url":"advent-of-code-day-2","date":"2020-12-02","content":"It's day 2, and there's another pair of challenges!\n\n> Your flight departs in a few days from the coastal airport; the easiest way down to the coast from here is via toboggan.\n\nAh, of course. Who would have thought.\n\n> Their password database seems to be a little corrupted: some of the passwords wouldn't have been allowed by the Official Toboggan Corporate Policy that was in effect when they were chosen.\n\nI guess this is one of the companies that require password changes often. Hate those guys.\n\n> To try to debug the problem, they have created a list (your puzzle input) of passwords (according to the corrupted database) and the corporate policy when that password was set.\n> For example, suppose you have the following list:\n> ```\n> 1-3 a: abcde\n> 1-3 b: cdefg\n> 2-9 c: ccccccccc\n> ```\n\nIt seems as if there's only a single \"corporate policy\" per each password, seperated by a colon.\n\n> Each line gives the password policy and then the password. The password policy indicates the lowest and highest number of times a given letter must appear for the password to be valid. For example, 1-3 a means that the password must contain a at least 1 time and at most 3 times.\n> \n> In the above example, 2 passwords are valid. The middle password, cdefg, is not; it contains no instances of b, but needs at least 1. The first and third passwords are valid: they contain one a or nine c, both within the limits of their respective policies.\n\n> How many passwords are valid according to their policies?\n\nAlright, this should be pretty easy.\nRight off the bat I can see that it's a very simple algorithm, which returns a boolean value, and we need to count how many times it's `true`. So let's dive into it!\n\n```kt\nfun main(){\n    val input = \"\"\"\n        1-3 a: abcde\n        1-3 b: cdefg\n        2-9 c: ccccccccc\n    \"\"\"\n\n    val lines = input.split(\"\\n\")       // split by lines\n            .filter(String::isNotBlank) // remove lines that are blank\n```\nWe'll try and use the sample input for testing, as we can verify the outcome.\n\nNow, we need to count the number of lines that have valid passwords. Kotlin (the language I'm using) has a builtin function for counting\n```kt\nfun List<T>.count(predicate: (T) -> Boolean): Int { ... }\n```\nThe function runs the `predicate` over each element, returning the count of ones that return `true`.\n\n```kt\nval answer = lines.count { line -> \n    // checking code ...\n}\n```\n\nIf we go back to the sample input, we can see it follows a simple grammar: `1-2 a: password`.\nWe need to extract certain parts of this input to put into variables\n```\n1-2 a: abcdefgh\n^ ^ ^  \\--------> password\n| | |\n| | letter\n| upper\nlower\n```\nThe fastest way to do this is to split the string at a couple key points - between each important element. We can use a regex to define where we want to split. \n```kt\nval (lower, upper, letter, password) = line.trim().split(Regex(\"(-)|(: )|( )\"))\n```\nFor those who don't know, regex is just a way of selecting text. If we split a string (the input) by a regex, we'll get all the text around it in a list, but not the text actually matched.\n\nThe regex we use here is pretty simple. The `|` OR bars let us match on *any* of the options, as long as one of them matches.\n```regex\n(-)|(: )|( )\n ^   ^^   ^\n |   |   Match a single space\n |  Match a colon, and then a space. This is the text between the letter and the password\nMatch a single hyphen character (split between the numbers)\n```\nHere I use a Kotlin feature called \"destructuring\" to put all the matched elements into separate variables, so the first match goes into the variable `lower`, and the next `upper`, and so one.\n\nNow we need to get how many of the letter `letter` is in the `password`.\nI used another `count` call to count how many letters in the password equalled the `letter` input.\n\n```kt\nval count = password.count { char -> char.toString() == letter }\n```\nI needed to convert the char to a string to compare it to `letter`, as `letter` is a `String`. \n\n*Note, if you're writing this in Java, you need to use `.equals()` to compare strings, instead of `==`*\n\nThen, we can just return if the `count` is within valid range. Here's what it ends up looking like:\n```kt\nval count = lines.count { line ->\n    val (lower, upper, letter, password) = line.trim().split(Regex(\"(-)|(: )|( )\"))\n\n    val count = password.count { char -> char.toString() == letter }\n    \n    return@count count >= lower.toInt() && count <= upper.toInt()\n}\n```\nNow, in Kotlin lambdas, we can remove the last return statement (it's automatically inserted). The finally solution for part 1 ends up being.\n```kt\nfun main1(): Int {\n    val lines = inputLines(day = 2)\n            .filter(String::isNotBlank)\n    val count = lines.count { line ->\n        val (lower, upper, letter, password) = line.trim().split(Regex(\"(-)|(: )|( )\"))\n\n        val count = password.count { char -> char.toString() == letter }\n\n        count >= lower.toInt() && count <= upper.toInt() // implicit return of this boolean\n    }\n    return count\n}\n```\n\nIt works for the sample input, and it works for my sample input.\n\n## Part 2\n\n> While it appears you validated the passwords correctly, they don't seem to be what the Official Toboggan Corporate Authentication System is expecting.\n> \n> The shopkeeper suddenly realizes that he just accidentally explained the password policy rules from his old job at the sled rental place down the street! The Official Toboggan Corporate Policy actually works a little differently.\n\nOh no! We'll have to copy our code and make some adjustments.\n\n> Each policy actually describes two positions in the password, where 1 means the first character, 2 means the second character, and so on. (Be careful; Toboggan Corporate Policies have no concept of \"index zero\"!) Exactly one of these positions must contain the given letter. Other occurrences of the letter are irrelevant for the purposes of policy enforcement.\n\nSo we need to get the two characters at the points `lower` and `upper` (plus one), see if they equal `letter`, and return true if and only if only one of them are equal. Our truth table would look like this,\n```js\nlower | upper | result\n  1       1       0     // both are equal, there's more then one, so it's a false result\n  1       0       1     // only one is equal, result is true\n  0       1       1     // same as 1, 0\n  0       0       0     // neither match, so it's false\n```\nyou might notice this truth table looks exactly like the `xor` function!\n\nLet's just write this out:\n```kt\nval result = (password[lower - 1] == letter) xor (password[upper - 1] == letter)\n```\n*Remembering that we need to subtract `1`, as the given inputs are based on a 1-index.*\n\nThere's some type issues we need to fix, though. `lower` is a `String` not an `Int`, `letter` is also a `String` not a `Char`. We'll have to convert them, which makes the code look a bit worse.\n```kt\nval result = (password[lower.toInt() - 1] == letter[0]) xor (password[upper.toInt() - 1] == letter[0])\n```\n\nNow we can integrate it into our original counting function.\n```kt\nfun main2(): Int {\n    val lines = inputLines(day = 2)\n            .filter(String::isNotBlank)\n    val count = lines.count { line ->\n        val (lower, upper, letter, password) = line.trim().split(Regex(\"(-)|(: )|( )\"))\n\n        val result = (password[lower.toInt() - 1] == letter[0]) xor (password[upper.toInt() - 1] == letter[0])\n        result // implict return\n    }\n    return count\n}\n```\nAnd that's it, part 2 was pretty easy. There is a couple changes I'll make to change this into more idiomatic Kotlin code, but is mostly irrelevant to the discussion.\n```kt\nfun main2(): Int = inputLines(day = 2)\n        .filter(String::isNotBlank)\n        .count { line -> \n            val (lower, upper, letter, password) = line.trim().split(Regex(\"(-)|(: )|( )\")) \n            (password[lower.toInt() - 1] == letter[0]) xor (password[upper.toInt() - 1] == letter[0]) \n        }\n```\n\nThanks for reading :) I plan on doing these writeups for as long as I have the time."}},"__N_SSG":true}