{"pageProps":{"id":"11","post":{"id":11,"title":"Chasing Boredom","desc":"successfully?","tags":["unreleased"],"url":"chasing_boredom","date":"2025-08-06","author":"Carson Graham","content":"(June 6th)\n\nI'm a 21st century addict\n\nI've spent the last several months unsuccessfully trying to stop using Reddit for doomscrolling. I've deleted my accounts (front page Reddit is shit, but still content), I've tried uninstalling it, I've tried uninstalling the *google play store* - this worked well because I didn't know how to reinstall it, until I needed to download the metro app. I've tried having reddit.com not work on my laptops (but it's so easy to re-enable)\n\nI just couldn't do it. You want to know what finally got me to put down Reddit for more than a few days? The fucking 'I am sober' app you see on 'beating addiction' subreddits. (fuck, more Reddit!)\n![](/img/doomscrolling.png)\nWhat makes this system work is that it creates a concrete object (the timer on the screen) that means something (I have genuinely earned it). If I touch Reddit, I lose this \"object\" - even if I don't go and reset the timer, I still inherently know it would mean nothing.\n\nI feel as though I shouldn't **need** to use tactics helpful for genuine addicts to control my behavior - but this just proves the point. I'm actually an addict. And that's scary.\n\n```bash\n# my therapist in university would say I shouldn't use the words \"should\" or \"shouldn't\". \n# and yes, he would say it like that\n```\n\nI've also left the majority of the discord servers I'm in. I have a list for ones to rejoin when I feel like I have control over my life, but for now, the benefit of not being in them outweighs what I'm \"missing out on\".\n\n*Stack Exchange* has also joined the list of internet services I literally cannot tear myself away from, after Reddit (and YouTube) was removed from my life. This growing list is both in my mind, and also in my [`/etc/hosts`](https://static.carson.sh/hosts) file, which works on Linux and Windows (why? I'll [never know](https://carson.sh/img/superuser.png))\n\n```bash\n$ # on an aside, if you ever want to know every single stackexchange subdomain\n$ curl https://api.stackexchange.com/2.3/sites?pagesize=100000 | jq '.items[] | .site_url' -r | sort | uniq\n$ # will get you every single one EXCEPT stackoverflow.com or stackexchange.com\n$ # It will, however, include 'lifehacks.meta.stackexchange.com', rest assure\n```\n\nI've learned comical amounts about how air traffic control works (I would link some interesting posts, but, alas), but I'm still *reaching for my phone or laptop* the moment I don't know what else to do with myself - which happens a lot these days. I'm back living with my parents after graduating, but only for like a week^ish^ right now, and then the month of July before I move out indefinitely. It feels hard to become more established.\n\nIt's not a lot of time, but I'm hoping it's enough time that I can focus my energy on creating some meaningful changes to my life.\n\nI want to be more bored?"}},"__N_SSG":true}